// pages/weilaijihua/weilaijihua.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    dataList: ["在谈及今后会否参与青少年篮球培训时，姚明给出了肯定答案。“想想我们自己，每个人都是从青年人一步步跨过来，到了这个年龄，也会想怎样使更多孩子加入到我们中来。” ","“我当然会参与更多，并利用上海队的平台，希望去引导孩子更多参与体育运动，热爱体育，使自己的体魄更加强健，通过体育成为一个更完善的人。”他说。","有记者问及姚明“是从NBA退役，还是彻底结束篮球生涯，以及是否会代表国家队征战2012年奥运会”时，姚明说，“自己已不会再踏上球场，从职业球员的角度来说，已经完全退役。但我没有从篮球生涯退役，篮球生涯可以有很多方式去延续。”其中的一种方式就是用新的模式经营、管理上海东方男篮。","中国篮球界何时会产生下一个“NBA的姚明”？对此，“小巨人”说：“在我登陆NBA之前，已经有宋涛、马健、王治郅和巴特尔在那里了，我从他们身上学到很多东西，肯定还会有人后来居上的。”  ","对于荷兰记者提问未来是否有可能去荷兰执教时，姚明回应说，做教练需要很多耐心，有时候为了取得成就，会牺牲很多事情，牺牲与家人在一起的时间。“自己是上海东方男篮的老板，已经让我够忙碌了，所以我会拒绝的。”"]

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})