// pages/xinggetezheng/xinggetezheng.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    dataList: ["正印证那句话，好饭不怕晚。不可否认大郅和巴特尔登陆NBA很让人欣喜，但说老实话，同他们两个相比，姚明加盟火箭队才是国内球员最成功的样板，堪称是中国篮球的经典。作为国家队队友，我很为他们高兴，尤其是姚明，状元秀的名头让中国篮球提气，更让咱中国人自豪！","说到姚明，我感觉他有双重性格，有的时候他像个稚气未脱的大男孩，可有的时候却像个沉稳老练的成年人。我还记得在２０００—２００１赛季，姚明率领上海队到我们的主场抚顺打比赛时的情形。那个赛季上海队的王者之气已初现，平心而论，我们的实力绝对逊色于他们，可最后的胜利却属于辽宁队。赛后，我看到输球后的姚明，脸红红的，眼泪在眼眶中打转，看他那样子就是个输急了的大孩子。可现在，我们为了世锦赛开始了北美之旅，姚明作为新科状元自然会被加拿大和美国媒体关注，在外国记者面前他都能老练并得体地回答问题，我们又看到他成熟的一面。","也许成长需要代价，尤其是对姚明这样的天才球员。在上个赛季夺得ＣＢＡ总冠军后，奋斗了几年的姚明品尝到了收获时的香甜，仿佛一夜之间姚明长大了不少。这次，以NBA选秀状元的身份在北美刮起旋风，作为队友，我们也都跟着沾了光。","姚明在休息时的最大爱好就是与室友刘玮打游戏，他们两个可是队内出了名的游戏高手，也许游戏能让姚明能从训练的疲劳中解脱出来。对于中国男篮来说，我们真正的“游戏”也要开始了，虎视眈眈的美国队正在奥克兰等着我们，我从翻译那儿了解到，美国队已放出风来，想看看姚明到底有什么本事。","这个时候，状元秀的表演时刻终于来到了，只是不知道夸下海口的ＮＢＡ球星能不能越过姚明这道坎儿？我想，他们被扇几个大帽儿再正常不过了。"]

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})