// pages/gongzuojingli/gongzuojingli.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    dataList: ["1998年4月，他入选王非执教的国家队，开始篮球生涯。5月，他赴美国印第安纳波利斯参加耐克夏令营的篮球训练，对手中有后来成为NBA球星的泰森·钱德勒。同年，他作为上海队主力获全国男篮甲A联赛第5名，并入选中国篮球明星队。  1999年5月，他入选蒋兴权执教的国家男篮和中国篮球南方明星队。他参加了全国男篮甲A联赛，代表上海队，与队友合作，获第5名。5月，获99赛季全国男篮甲A联赛最有进步球员奖。同年8月，他参加在日本举行的亚洲男子篮球锦标赛，与全队配合获得亚洲男篮锦标赛冠军。  2000年2月，他入选1999年亚洲全明星队。3月，他入选蒋兴权执教的国家男篮和全国男篮甲A联赛全明星阵容，并参加1999-2000年全国男篮甲A联赛，与队友合作获上海东方队获得第二名。他个人获1999-2000赛季全国  少年姚明游长城 男篮甲A联赛篮板、扣篮、盖帽三个单项奖。9月，他参加在悉尼举行的第二十七届奥运会男篮比赛，与队友合作获第十名。  2001年4月，他参加2000-2001年全国男篮甲A联赛，与队友合作获上海东方队获得第二名。  2002年，他以状元秀身份被NBA的休斯敦火箭队选中。  2003年10月1日，他率领中国男篮拿到亚锦赛冠军，同时获得雅典奥运会入场券。  2004年2月23日，对阵老鹰队获得职业生涯单场得分最高41分和最高助攻7次。  2005年3月11日，对阵太阳队得到职业生涯单场最高篮板22个。   姚明与麦迪 2006年11月14日，对阵马刺获得职业生涯最高抢断次数4次。12月16日，对阵湖人获得职业生涯最高盖帽8个。  2009年1月18日，对阵热火12投12中拿到26分。3月14日，对阵山猫投中赛季第1个3分。2009年4月19日，对阵开拓者姚明在24分钟内9投9中得到24分。5月5日，对阵湖人的西部半决赛第一场中受伤，但经过调整后执意冲回赛场，并最终带领火箭取得胜利。5月10日，左脚骨裂，该赛季报销。7月，他成为上海大鲨鱼俱乐部老板。  2010年5月4日，他入选男篮集训名单。11月10日是他职业生涯最后一场比赛，他上场6分钟没有得分进账，拿到1板1帽后便因伤离场。12月18日，火箭队医确认姚明因再次脚踝中部应力骨折无缘赛季。  2011年7月9日，NBA官方网站称姚明已决定从NBA退役。7月20日下午2时，姚明在新闻发布会上正式宣布退役。  左脚踝骨裂时的姚明  2012年9月20日，湖北省高级人民法院公开宣判，在姚明诉武汉云鹤大鲨鱼体育用品有限公司侵权案中，姚明胜诉，并获赔100万元。  2014年6月，参加湖南卫视《爸爸去哪儿》客串嘉宾。  2014年10月24日，姚明参加观澜湖世界明星赛开幕仪式。网友发现姚巨人也鼓出了大肚腩，身材走样。有网友调侃称，姚明竟然有了维尼熊的即视感。  2015年2月10日，姚明接受北京冬奥申委颁发的聘书，成为北京申办冬奥会形象大使。他还表示能有机会为北京申办冬奥会做贡献，他感到非常荣幸。3月27日，姚明被评选为，全球50位最杰出的领袖人物。  2016年3月9日，上海男篮投资人姚明将出任新成立的中职联公司董事长兼经理。4月6日，姚明正式入选了奈史密斯篮球名人堂。4月16日，火箭队老板莱斯利-亚历山大计划退役前火箭队中锋姚明的球衣。  姚明11号球衣正式退役(10)  2017年2月4日，姚明的11号球衣在火箭主场对公牛的中场休息时退役。  姚明的整个NBA生涯都是在火箭队度过的，身穿11号球衣的他场均上场32.5分钟，可以得到19.0分9.2篮板1.9盖帽。  2017年2月23日，在中国篮球协会第九届全国代表大会上，姚明当选篮协主席。3月16日，据CCTV5官微透露，上海男篮已经完成了部分股权的转让，姚明正在兑现自己的承诺：在下赛季开始前彻底脱身上海男篮的运营。  2017年5月11日，北京体育大学中国篮球运动学院正式成立，中国篮协主席姚明应邀出任该学院的名誉院长。  2017年7月20日，经中国篮协提名，公司董事会表决通过任命姚明为CBA公司董事长。  2018年2月，中国篮协主席姚明主持第9届中国篮协工作会议，通过关于成立篮协理事会的议案。[3]  2018年11月5日，姚明被国家体育总局推荐为改革开放杰出贡献奖项的候选人选。[4]  2018年12月12日，姚明获得2018年度大本钟奖之赫拉特勒斯奖之改革开放四十周年十大杰出华裔体育贡献奖。[5]  2019年6月9日，当选为亚篮联中央局主席。", "▪2018  2018年度大本钟奖之赫拉特勒斯奖之改革开放四十周年十大杰出华裔体育贡献奖（获奖）", "▪2018   改革先锋称号、体育领域交流开放的优秀代表 ", "2018 第十届“中华慈善奖”慈善楷模", " 2018 2017中国慈善名人榜TOP30 排第7名 ","▪2016  入选2016年奈·史密斯篮球名人纪念堂   （获奖）    ","▪2015    劳伦斯世界体育奖体育精神奖    （获奖）  ","▪2015    上海获美中杰出贡献奖    （获奖）   ","▪2013    传播中华文化年度人物    （获奖）  ","▪2013    上海体育事业白玉兰终身成就奖金质奖章    （获奖）  ","▪2012    最有远见的年度人物    （获奖）    ","▪2011    中国奥林匹克金质奖章    （获奖） ","▪2011    上海市体育事业白玉兰终身成就奖    （获奖）   ","▪2002    感动中国十大人物之一    （获奖）   ","▪2002    CBA总冠军上海队主力成员    （获奖）   ","▪2000    入选CBA全明星阵容    （获奖）  ","▪2000    CBA三个单项奖    （获奖）  ","▪1999    CBA最有进步球员奖    （获奖）"]

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})