// pages/xingquaihao/xingquaihao.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    dataList: ["喜欢的颜色：蓝色","喜欢的动物：都伯文狗","喜欢的食物：肉肠、西红柿"," 喜欢的菜系：妈妈的菜 ","喜欢的节日：国庆节"," 喜欢的作家：叶永烈，老舍"," 喜欢的歌手：没有固定的喜欢歌手"," 喜欢的歌曲：流行歌曲"," 喜欢的服装：运动，休闲 ","喜欢的城市：上海"," 喜欢的国家：中国 ","喜欢的影星：丹泽尔.华盛顿 ","喜欢的电影：《虎口脱险》","  最喜欢做的事情：打高水平、很刺激的比赛 ","最大的烦恼：不能像普通人一样生活 ","崇拜的人物：周恩来，刘备"," 休闲地方： 星巴克咖啡屋"," 业余爱好：打电脑游戏（如WOW）、上网冲浪、音乐、看书 ","欣赏偶像：萨博尼斯、奥拉朱旺"," 座右铭：相信自己、年轻不应平凡 ","绰号：沪上天棚，小巨人，遮天小巨人，巨无霸，状元郎，潜龙，松鼠等；外国人一般称其：明王朝、移动长城等"]

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})