// pages/jinengtechang/jinengtechang.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    dataList: ["当然，姚明也有自己的问题，那就是他的球风并不为球迷所认同。球迷或者说姚明的同行的心目中内线球员哪一项技术最具说服力呢？在这项相关的调查中，有超过5成的球迷选择的是篮板球。而得分这项甚至还弱于封盖，仅仅有一成多一点的球迷认为得分是内线球员最需要的能力。这反映了目前球迷对于篮球场上球员分工的理想状态，在他们看来，得分应该是身材相对更接近常人的后卫球员的工作，而内线球员要做的就是摘下那些后卫球员所没有投进的篮板球再交给外线球员来表演。","这同时也说明了为什么中国长城不能得到广大美国球迷认同的原因，因为他的篮板球能力相比较这个位置的其他顶级球员来说并不突出。职业生涯至今，姚明只在2005-06赛季以及本赛季场均的篮板球达到了两位数，他从来就没有在这项统计上居于联盟前五的位置之上。因此，当我们可以称奥尼尔为禁区霸主，称德怀特-霍华德为内线怪物的时候，我们在谈及姚明的禁区统治力之时却很难底气十足。姚明最擅长的得分恰恰又不是球迷看重的，难怪当姚明在内线有时候抓不到篮板，甚至被内特-罗宾逊这样的对手欺负之时缺能博得比他高得分更多的关注度。","对于姚明而言，他现在的实力已经征服了美国的本土球迷。或许他注定不能成为德怀特-霍华德或者奥尼尔那样的篮下怪物，但是这又有什么关系呢。每一名球员都有他自己的球风，姚明不是奥尼尔，这从他先天的身体条件就已经决定。但奥尼尔或者霍华德也不能成为姚明，联盟还有谁具备姚明在低位那样的攻击力么？"]

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})