// pages/chengzhangjingli/chengzhangjingli.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    dataList: ["姚明17岁时第一次见到叶莉。在1999年，姚明终于进入了国家队后，他约叶莉出去玩被拒绝。之后两人相恋。  2007年8月3日，姚明和叶莉在上海徐汇区婚姻登记处，正式领取了结婚证书。8月6日，两人在上海香格里拉酒店举办婚礼。  2010年1月姚明妻子叶莉被证实怀孕，宝宝在2010年“世博会闭幕式”之前出生。5月21日，姚明的妻子叶莉于在休斯敦当地医院顺利产下一女。  2011年4月21日，姚明在上海梅陇基地召开了回国后的首次媒体见面会，公布了女儿的名字：姚沁蕾。  学业经历 2011年11月6日，姚明前往上海交通大学报到。  姚明  2012年11月27日，香港大学举行第187届学位颁授典礼授予其名誉社会科学博士学位，以表彰他对运动及推动国际社会关注艾滋病所做出的贡献。  2011年7月8日，姚明入学上海交通大学安泰经济与管理学院。  2018年7月8日，姚明从上海交通大学安泰经济与管理学院本科毕业", "最长连胜记录：2008年1月29日-3月16日取得22连胜（因伤只参与10场） ", " 最高单场命中率：  2009年1月18日，常规赛对阵热火，12投12中，命中率100%，得到26分，创造球队历史记录。", " 2009年4月19日，季后赛首轮第一场对阵开拓者，9投9中，命中率100%，得到24分。", "  CBA记录 ", " 单场最高得分：49分 ", " 单场最高篮板：31个  ", "单场最高盖帽：13个 ", " 单场比赛21投全中 ", " 国家队记录  ", "  单场得分39分 国家队第一 ", " 单届世界大赛场均25.3得分最高球员", "2007年9月14日，由姚明和纳什共同发起的慈善义赛在北京首钢体  姚明(15) 育馆举行。10月，专为智障人士举行的世界特殊奥林匹克运动会在姚明的家乡上海举行。2007年10月2日开幕式当晚，特地从美国赶到上海的姚明参加了开幕式。  2008年5月14日，姚明第一时间向汶川地震灾区捐款50万元人民币，在美国向中国红十字会外币账户捐款21.4万美元，捐款总额约合200万元人民币。6月11日姚明宣布，向四川地震灾区捐赠200万美元，并成立姚明基金会帮助灾区进行校园重建。6月26日，“姚基金”中文官方网站正式上线。8月8日，北京奥运会开幕式上，作为中国代表团旗手的姚明，拉着四川省汶川县映秀镇渔子溪小学二年级学生、小英雄林浩的手，走在队伍最前列。中秋节，姚明来到四川省广元市建设村。  2009年12月，入主上海男篮成为“姚老板”的姚明携全体上海男篮队员，郑重发出拒吃鱼翅宣言。  2010年，  　申冬奥形象大使姚明接受记者采访 以“城市，让生活更美好”为主题的世博会在上海举行，姚明义担当起了上海世博会形象大使。  2011年，特奥会即将在希腊雅典举行。6月9日至10日，姚明一行来到酒泉,为酒泉特殊儿童“上课”，并出席“酒泉纳什—姚基金特殊教育学校”竣工典礼。6月26日，“姚大使”来到雅典参加与特奥有关的各种活动，包括特奥运动员健康行动启动仪式、特奥会创始人施莱弗女士铜像揭幕仪式等，继续用实际行动支持特奥运动发展。9月22日，姚明和理查德·布兰森出席由国际环保组织野生救援协会在上海举办的“共同倡导保护濒危物种鲨鱼”公益活动。姚明并呼吁作为鱼翅主要消费群体的华人，在保护鲨鱼方面作出表率。  2013年9月，姚明和英国威廉王子、足球巨星大卫·贝克汉姆一起为慈善救援组织拍摄了一组宣传救助野生保护动物的宣传片。11月29日，NBA中国与姚明共同宣布，NBA姚明学校于2013年12月1日起正式接受报名。   姚明在接受“ALS冰桶挑战” 2014年8月23日，巨人姚明与78岁韩美林在NBA姚明学校共同挑战冰桶。据了解，NBA中国首席执行官舒德伟在近日完成冰桶挑战后，向姚明发出“挑战”。姚明在五棵松篮球公园完成ALS冰桶挑战，和其他人不同的人，身高2米26的姚明接受了4桶冰水的灌溉。  “ALS冰桶挑战”的目的是为了提高大众对于ALS(肌肉萎缩性侧索硬化症)的认识，并号召人们为ALS协会捐款。截止目前，各行各业的明星大腕都已纷纷加入其中。  2015年2月10日，北京冬奥申委副主席张建东和中国奥委会秘书长宋鲁增向姚明等六位运动员颁发了北京冬奥申委颁发的聘书，姚明正式成为北京申办冬奥会形象大使。  姚明在接受聘书后表示，自己虽然从事的是夏季运动，但是一见到冰雪就兴奋。姚明说，他个人非常喜欢观赏冬季运动比赛，最喜欢的项目是花样滑冰、速度滑冰和冰壶。担任北京申办冬奥会形象大使，能有机会为北京申办冬奥会做贡献，感到非常荣幸。  2016年3月28日，  姚明参考保护动物公益活动(8) 姚明成为上海迪士尼度假区荣誉大使。  2016年10月，姚明成为中国火星大使，为中国火星探测工程名称和图形标识全球征集活动宣传推广工作代言。  2017年2月2日，美国第四大城市休斯敦的市长西尔维斯特·特纳宣布，任命前NBA休斯敦火箭队中国球星姚明为休市亲善大使，以表彰和纪念他在篮球和慈善界、在美中两国文化交流与合作方面做出的杰出贡献。  政治活动 2008年8月6日，在北京参加奥运圣火传递。8月8日，担当中国奥运代表队旗手。  2011年12月5日，姚明当选上海公共外交协会副会长，兼荣誉大使。12月21日，上海市政协举行十一届三十一次常委会议，增补姚明为十一届市政协委员。  2012年1月15日，被增选为政协上海市第十一届委员会常务委员。1月17日，被增补为上海市体育总会第七届委员会常委、副主席。  2013年2月1日，当选第十二届全国政协委员。  2013年7月28日，  姚明两会现场图片(8) 姚明经国际奥委会宣布成为南京青奥会大使。  2015年1月27日上午，国务院总理李克强在中南海主持召开座谈会，听取教育、科技、文化、卫生、体育界10位代表对《政府工作报告》的意见和建议，10位代表中包括姚明。  2016年3月2日，全国政协委员姚明现身北京会议中心报到，参加2016年全国两会。  2016年3月24日，姚明参加博鳌亚洲论坛2016年年会。  2017年8月，当选中国篮球协会篮球学院院长。  2018年5月31日，姚明成首批冰雪推广大使。[10]  演艺经历 2017年1月27日，中央电视台春节联欢晚会上海分会场，姚明与众家庭共同登台唱响“家和万事兴”主题。  2018年1月31日，“2017中国慈善名人榜TOP30”揭晓，姚明排第7名。[11]  2018年2月17日，参加《奔跑吧，新时代——2018体育嘉年华》。"]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})