// pages/peixunjingli/peixunjingli.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    dataList: ["1980年9月12日傍晚，姚明出生于上海市第六人民医院，出生时体重5公斤，比普通新生儿重了几乎一倍。姚明的父亲姚志源身高2米08，母亲方凤娣身高1米88，两人均是打篮球出身。姚志源退役后，分配到上海海事局。方凤娣则进了体育科研所。当时姚家居住在西康路一老式里弄住宅。   姚明(左二)与小伙伴在一起（1983年）王良佐/摄 1982年，姚明随父母搬进位于康平路95号的上海体育学院职工宿舍602室。楼里住的都是上海体委的职工，王良佐、沈富麟等当时都是姚家的邻居。姚明出生后，姚明父母工资的大部分都用在伙食上，方风娣很长一段时间每个月只有四十多元的收入。姚明长身体的时候，食量很大。为了保证姚明的营养，姚明父母只能省吃俭用。由于姚明对牛奶的需求也特别大，姚志源从牛奶厂工人朋友那里得到了牛奶卡，才使姚明每天都有牛奶喝。  1986年的秋天，姚明提前一年进入高安路一小读书，当时姚明身高是1.47米。姚明一家离开了体育学院的职工宿舍，搬入到康平路的新居。小学的姚明是个喜欢读书的孩子，但因为身高不得不开始篮球训练。姚明因为自己小时候因身高超群而感到自卑。性格内向，也是最受欺负的一个。  1989年，姚明开始在徐汇区少体校开始进行业余篮球训练，姚明进入少体校的一个重要原因，是因为当时少体校的学生有伙食补助。1990年，姚明参加了由上海市体育局主办的篮球夏令营活动。他开始参加正式篮球比赛。姚志源也经常用奖品鼓励姚明。很多专家不看好姚明，因为他太高了。方凤娣则没想让他打专业队，只想升学能加分。1991年，姚明五年级毕业，身高已超过1米80，在班中他是最高的。  1993年，姚明的身高达到了1米96，进入上海大鲨鱼青年队训练。一开始每天练10个小时，一周练6天。头一个月练的非常辛苦，瘦了40斤。当时姚明与队友刘炜每个月只有10元的津贴收入，他们共同的爱好是训练结束后去打世嘉的街机。"]

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})